onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РСК_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.РСК_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РСК_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ++ Дз13 07.09.26 (Добаление реквизита КонтактноеЛицо на форму документа)
	ЭлементРСК_КонтактноеЛицо = Элементы.Вставить("РСК_КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво, Элементы.Договор);
	ЭлементРСК_КонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементРСК_КонтактноеЛицо.ПутьКДанным = "Объект.РСК_КонтактноеЛицо";
	// -- Дз13 07.09.26 (Добаление реквизита КонтактноеЛицо на форму документа)
	
	
	// ++ Дз13 07.09.26 (Добаление реквизита РСК_СогласованнаяСкидка и команды Пересчитать на форму документа)
	ЭлементРСК_СогласованнаяСкидка = Элементы.Вставить("РСК_СогласованнаяСкидка", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛево);
	ЭлементРСК_СогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементРСК_СогласованнаяСкидка.ПутьКДанным = "Объект.РСК_СогласованнаяСкидка";
	
	ГруппаСкидка = Элементы.Вставить("ГруппаРСК_СогласованнаяСкидка", Тип("ГруппаФормы"),
	    	Элементы.РСК_СогласованнаяСкидка.Родитель, Элементы.РСК_СогласованнаяСкидка);
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаСкидка.ОтображатьЗаголовок = Ложь;
    //ГруппаСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;
    ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;

	Элементы.Удалить(Элементы.РСК_СогласованнаяСкидка);
       
	ЭлементСкидка = Элементы.Вставить("РСК_СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаСкидка);
	ЭлементСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСкидка.ПутьКДанным = "Объект.РСК_СогласованнаяСкидка";
	ЭлементСкидка.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");

    КомандаПересчитать = Команды.Добавить("ПересчитатьСкидку");
    КомандаПересчитать.Действие = "ПересчитатьСтрокиТЧ";
    КнопкаПересчитать = Элементы.Добавить("ПересчитатьСкидкуКнопка", Тип("КнопкаФормы"), ГруппаСкидка);

	КнопкаПересчитать.Картинка = БиблиотекаКартинок.Перечитать;
	КнопкаПересчитать.Отображение = ОтображениеКнопки.КартинкаИТекст;
	                                                           
	КнопкаПересчитать.ИмяКоманды = "ПересчитатьСкидку";
    КнопкаПересчитать.Заголовок  = "Пересчитать";
	// -- Дз13 07.09.26 (Добаление реквизита РСК_СогласованнаяСкидка и команды Пересчитать на форму документа)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	// ++ Дз13 07.09.26 (Расчет СуммыСироки с учетом Согласованной скидки)
	ОбщаяСкидка = ТекущиеДанные.Скидка + Объект.РСК_СогласованнаяСкидка;
	
	Если ОбщаяСкидка > 100 Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ("Размер скидки превышает 100%");
		Сообщение.Сообщить();
	
		ТекущиеДанные.Скидка = 0;
		ОбщаяСкидка = ТекущиеДанные.Скидка + Объект.РСК_СогласованнаяСкидка;
		
	КонецЕсли;
		
		КоэффициентСкидки = 1 - ОбщаяСкидка / 100;
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	// -- Дз13 07.09.26 (Расчет СуммыСироки с учетом Согласованной скидки)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

// ++ Дз13 07.09.26 (Расчет СуммыСироки с учетом Согласованной скидки)

&НаКлиенте
Асинх Процедура СогласованнаяСкидкаПриИзменении(Элемент)

	Вопрос = ВопросАсинх("Изменен процент скидки. Пересчитать таблицы товаров и услуг?", РежимДиалогаВопрос.ДаНет);
	ОтветНаВопрос = Ждать Вопрос;
	
	Если ОтветНаВопрос <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ПересчитатьСтрокиТЧ();

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокиТЧ()

	МаксСкидкаТовары = 0;
	МаксСкидкаУслуги = 0;

	Для каждого Строка Из Объект.Товары Цикл
		
		Если Строка.Скидка > МаксСкидкаТовары Тогда
			
			МаксСкидкаТовары = Строка.Скидка;
			
		КонецЕсли;

	КонецЦикла;

	Для каждого Строка Из Объект.Услуги Цикл
		
		Если Строка.Скидка > МаксСкидкаУслуги Тогда
			
			МаксСкидкаУслуги = Строка.Скидка;
			
		КонецЕсли;
		
	КонецЦикла;

	Если МаксСкидкаУслуги > МаксСкидкаТовары Тогда
		
		МаксимальнаяСкидка = МаксСкидкаУслуги;
		
	Иначе
		
		МаксимальнаяСкидка = МаксСкидкаТовары;
		
	КонецЕсли;

	Если МаксимальнаяСкидка + Объект.РСК_СогласованнаяСкидка > 100 Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ("Размер скидки превышает 100%");
		Сообщение.Сообщить();
		Объект.РСК_СогласованнаяСкидка = 0;
		
	КонецЕсли;
	
	Для Каждого Строка Из Объект.Товары Цикл
		
		РассчитатьСуммуСтроки(Строка);
		
	КонецЦикла; 
	
    Для Каждого Строка Из Объект.Услуги Цикл
		
		РассчитатьСуммуСтроки(Строка);
		
	КонецЦикла;       

КонецПроцедуры

// -- Дз13 07.09.26 (Расчет СуммыСироки с учетом Согласованной скидки)


#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
